In [4]:
import pandas as pd

In [5]:
df = pd.read_excel("../data/dataset_v1.xlsx")

In [6]:
df.head(10)

,Unnamed: 0,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,0,LP001002,Male,No,0,Graduate,No,5849,0.0,146.369492,360,1,Urban,Y
1,1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.000000,360,1,Rural,N
2,2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.000000,360,1,Urban,Y
3,3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.000000,360,1,Urban,Y
4,4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.000000,360,1,Urban,Y
5,5,LP001011,Male,Yes,2,Graduate,Yes,5417,4196.0,267.000000,360,1,Urban,Y
6,6,LP001013,Male,Yes,0,Not Graduate,No,2333,1516.0,95.000000,360,1,Urban,Y
7,7,LP001014,Male,Yes,3+,Graduate,No,3036,2504.0,158.000000,360,0,Semiurban,N
8,8,LP001018,Male,Yes,2,Graduate,No,4006,1526.0,168.000000,360,1,Urban,Y
9,9,LP001020,Male,Yes,1,Graduate,No,12841,10968.0,349.000000,360,1,Semiurban,N

In [7]:
df.isna().sum()

Unnamed: 0           0
Loan_ID              0
Gender               0
Married              0
Dependents           0
Education            0
Self_Employed        0
ApplicantIncome      0
CoapplicantIncome    0
LoanAmount           0
Loan_Amount_Term     0
Credit_History       0
Property_Area        0
Loan_Status          0
dtype: int64

In [8]:
df.shape

(611, 14)

In [9]:
df.dropna(subset=["Married"], inplace=True)

In [10]:
df.shape

(611, 14)

In [11]:
df.Gender.unique()

array(['Male', 'Female'], dtype=object)

In [12]:
df.Gender.value_counts()

Gender
Male      500
Female    111
Name: count, dtype: int64

In [13]:
df.Gender = df.Gender.fillna("Male")

In [14]:
df.Dependents.unique()

array([0, 1, 2, '3+', '0'], dtype=object)

In [15]:
df.Dependents.value_counts()

Dependents
0     345
1     102
2     101
3+     51
0      12
Name: count, dtype: int64

In [16]:
df.Dependents = df.Dependents.fillna("0")

In [17]:
df.Self_Employed.unique()

array(['No', 'Yes'], dtype=object)

In [18]:
df.Self_Employed.value_counts()

Self_Employed
No     527
Yes     84
Name: count, dtype: int64

In [19]:
df[df.Self_Employed.isna()]

Empty DataFrame
Columns: [Unnamed: 0, Loan_ID, Gender, Married, Dependents, Education, Self_Employed, ApplicantIncome, CoapplicantIncome, LoanAmount, Loan_Amount_Term, Credit_History, Property_Area, Loan_Status]
Index: []

In [20]:
df_top = df[df.index < 600]
df_bottom = df[df.index >= 600]

In [21]:
df_top.shape, df_bottom.shape

((600, 14), (11, 14))

In [22]:
df_top.loc[:, "Self_Employed"] = df_top.Self_Employed.fillna("No")
df_bottom.loc[:, "Self_Employed"] = df_bottom.Self_Employed.fillna("Yes")

In [23]:
df = pd.concat([df_top, df_bottom])

In [24]:
df.shape

(611, 14)

In [25]:
df.Self_Employed.value_counts()

Self_Employed
No     527
Yes     84
Name: count, dtype: int64

Replace null values of Loan_Amount with its mean

In [26]:
loan_amt_mean = df.LoanAmount.mean()

In [27]:
df.LoanAmount = df.LoanAmount.fillna(loan_amt_mean)

In [28]:
df.Loan_Amount_Term.unique()

array([360, 120, 240, 180,  60, 300, 480,  36,  84,  12])

In [29]:
df.Loan_Amount_Term.value_counts()

Loan_Amount_Term
360    525
180     44
480     14
300     13
84       4
120      3
240      3
60       2
36       2
12       1
Name: count, dtype: int64

In [30]:
df.Loan_Amount_Term = df.Loan_Amount_Term.fillna(360.0)

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 611 entries, 0 to 610
Data columns (total 14 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         611 non-null    int64
 1   Loan_ID            611 non-null    object
 2   Gender             611 non-null    object
 3   Married            611 non-null    object
 4   Dependents         611 non-null    object
 5   Education          611 non-null    object
 6   Self_Employed      611 non-null    object
 7   ApplicantIncome    611 non-null    int64
 8   CoapplicantIncome  611 non-null    float64
 9   LoanAmount         611 non-null    float64
 10  Loan_Amount_Term   611 non-null    int64
 11  Credit_History     611 non-null    int64
 12  Property_Area      611 non-null    object
 13  Loan_Status        611 non-null    object
dtypes: float64(2), int64(4), object(8)
memory usage: 71.6+ KB

In [32]:
df.Credit_History.value_counts()

Credit_History
1    494
0    117
Name: count, dtype: int64

In [33]:
df.shape

(611, 14)

In [34]:
df_top = df[df.index < 306]
df_bottom = df[df.index >= 306]

In [35]:
df_top.shape, df_bottom.shape

((306, 14), (305, 14))

In [36]:
df_top.loc[:, "Credit_History"] = df_top.Credit_History.fillna(1.)

In [37]:
df_bottom.loc[:, "Credit_History"] = df_bottom.Credit_History.fillna(0.)

In [38]:
df = pd.concat([df_top, df_bottom])
df.shape

(611, 14)

In [39]:
df.head(5)

,Unnamed: 0,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,0,LP001002,Male,No,0,Graduate,No,5849,0.0,146.369492,360,1,Urban,Y
1,1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.000000,360,1,Rural,N
2,2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.000000,360,1,Urban,Y
3,3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.000000,360,1,Urban,Y
4,4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.000000,360,1,Urban,Y

In [40]:
df.to_excel('../data/dataset_v1.xlsx' , index = None)